# BuildingEnvelopeAnalyzer Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuildingEnvelopeAnalyzer Class
Members See Also
---
Analyzes which elements are part of the building envelope, the building elements exposed to the outside.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class BuildingEnvelopeAnalyzer : IDisposable
```

Visual Basic
---
```text
Public Class BuildingEnvelopeAnalyzer _
	Implements IDisposable
```

Visual C++
---
```text
public ref class BuildingEnvelopeAnalyzer : IDisposable
```

# Remarks
This class uses a combination of ray-casting and flood-fill algorithms in order to find the building elements that are exposed to the outside of the building. This method can also look for the bounding building elements for enclosed space volumes inside the building.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..BuildingEnvelopeAnalyzer
# See Also
BuildingEnvelopeAnalyzer Members
Autodesk.Revit.DB.Analysis Namespace